CSI API ETABS v1
cDesignSteel.Canadian_S16_24 Property
 CSA S16-24 steel design code.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cDStCanadian_S16_24 Canadian_S16_24 { get; }
ReadOnly Property Canadian_S16_24 As cDStCanadian_S16_24
	Get
Dim instance As cDesignSteel
Dim value As cDStCanadian_S16_24
value = instance.Canadian_S16_24
property cDStCanadian_S16_24^ Canadian_S16_24 {
	cDStCanadian_S16_24^ get ();
}
abstract Canadian_S16_24 : cDStCanadian_S16_24 with get
Return Value
Type: cDStCanadian_S16_24
CSA S16-24 steel design code.
Remarks
Added to ETABS in API v2.6.
See Also
Reference
cDesignSteel Interface
ETABSv1 Namespace